import streamlit as st

# Басты тақырып
st.title("Координаталық жазықтықтағы нүктенің квадрантын анықтау")

# Пайдаланушыдан x және y координаталарын енгізуін сұрау
x = st.number_input("x координатасын енгізіңіз:", value=0)
y = st.number_input("y координатасын енгізіңіз:", value=0)

# Квадрантты анықтау
if x > 0 and y > 0:
    st.success("Нүкте I квадрантта орналасқан.")
elif x < 0 and y > 0:
    st.success("Нүкте II квадрантта орналасқан.")
elif x < 0 and y < 0:
    st.success("Нүкте III квадрантта орналасқан.")
elif x > 0 and y < 0:
    st.success("Нүкте IV квадрантта орналасқан.")
elif x == 0 and y == 0:
    st.warning("Нүкте координаталар басында орналасқан.")
else:
    st.info("Нүкте координаталық осьтің бойында жатыр.")
